STChens/STM32CubeH5/Projects/NUCLEO-H553ZG/Applications/ROT/Loader/Src/fw_update_app.c
/**
  ******************************************************************************
  * @file    fw_update_app.c
  * @author  MCD Application Team
  * @brief   Firmware Update module.
  *          This file provides set of firmware functions to manage Firmware
  *          Update functionalities.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include "stm32h5xx_hal.h"
#include "com.h"
#include "common.h"
#include "ymodem.h"
#include "fw_update_app.h"
#include "region_defs.h"
#include "Driver_Flash.h"
#include "string.h"

/** @addtogroup USER_APP User App Example
  * @{
  */
#define BOOTLOADER_BASE_NS                  (0x0BFA4000U)
#define BOOTLOADER_SIZE                     (0xC000U)
/* Engi bits */
#define ENGI_START                          (0x08FFF800UL)
//#define ENGI_SIZE                           (0x40UL)
#define ARRAY_SIZE(array)                   (sizeof(array) / sizeof((array)[0]))
/* SRAM1 configuration
   =================== */
/* SRAM1 NB super-block */
#define GTZC_MPCBB1_NB_VCTR (16U)
/* SRAM3 NB super-block */
#define GTZC_MPCBB3_NB_VCTR (20U)
/* MPCBB : All SRAM block non privileged + privileged */
#define GTZC_MPCBB_ALL_NPRIV (0x00000000UL)
/* MPCBB : All SRAM block non secure */
#define GTZC_MPCBB_ALL_NSEC (0x00000000UL)
#define TZSC_MASK_R1  (GTZC_CFGR1_USART2_Msk | GTZC_CFGR1_USART3_Msk | GTZC_CFGR1_SPI3_Msk  | GTZC_CFGR1_SPI2_Msk | \
                       GTZC_CFGR1_I2C1_Msk | GTZC_CFGR1_I3C1_Msk   | GTZC_CFGR1_IWDG_Msk )
#define TZSC_MASK_R2  (GTZC_CFGR2_USART1_Msk | GTZC_CFGR2_SPI1_Msk   | GTZC_CFGR2_I2C3_Msk  | GTZC_CFGR2_USB_Msk | \
                       GTZC_CFGR2_FDCAN2_Msk | GTZC_CFGR2_FDCAN1_Msk| GTZC_CFGR2_UCPD1_Msk )
#define TZSC_MASK_R3  (GTZC_CFGR3_ICACHE_REG_Msk | GTZC_CFGR3_CRC_Msk )

/* NVIC configuration
   ================== */
/** Interrupts 0 .. 31 */
/** in ITNS0 GPDMA1_Channel0_IRQn | GPDMA1_Channel1_IRQn | GPDMA1_Channel2_IRQn bit27|28|29  is non secure */
/** 0x3800000000 => (switch to binary format) : 0011 1000 0000 0000 0000 0000 0000 0000 */
/** From binary format we can check that bit positions 27, 28, 29 are setted */
#define RSS_NVIC_INIT_ITNS0_VAL      (0x38000000U)

/** Interrupts 32 .. 63 */
/** in ITNS1 no bit is non secure */
#define RSS_NVIC_INIT_ITNS1_VAL      (0x00000000U)

/** Interrupts 64 .. 95 */
/** in ITNS2 OTG_FS_IRQn 74, i.e bit 10 is non secure (1) */
#define RSS_NVIC_INIT_ITNS2_VAL      (0x00000400U)

/** Interrupts 96 .. 127 */
/** I3C1_EV_IRQn = 123 */ 
#define RSS_NVIC_INIT_ITNS3_VAL      (0x08000000U)

#define GPIOA_MASK_SECCFG    (GPIO_PIN_MASK & \
                              (GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |  GPIO_PIN_8 | GPIO_PIN_9  | GPIO_PIN_10 | \
                               GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_15 ))
#define GPIOB_MASK_SECCFG    (GPIO_PIN_MASK & \
                              (GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15 ))
#define GPIOC_MASK_SECCFG    (GPIO_PIN_MASK & (GPIO_PIN_1 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 ))
#define GPIOD_MASK_SECCFG    (GPIO_PIN_MASK & (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_12 | GPIO_PIN_13 ))

extern ARM_DRIVER_FLASH FLASH_PRIMARY_SECURE_DEV_NAME;
extern ARM_DRIVER_FLASH FLASH_PRIMARY_DATA_SECURE_DEV_NAME;

struct sau_cfg_t
{
  uint32_t RNR;
  uint32_t RBAR;
  uint32_t RLAR;
};
const struct sau_cfg_t sau_load_cfg[] =
{
  /* allow non secure access to SRAM3 */
  {
    0,
    (uint32_t)SRAM1_BASE_NS,
    ((uint32_t)SRAM3_BASE_NS + SRAM3_SIZE - 1U),
  },
  /* allow non secure access to periph */
  {
    1,
    (uint32_t)PERIPH_BASE_NS,
    ((uint32_t)PERIPH_BASE_S + 0xFFFFFFFUL),
  },
  /* allow non secure access to all user flash except secure part and area covered by HDP extension */
  {
    2,
    (uint32_t)FLASH_BASE_NS,
    (uint32_t)(FLASH_BASE_NS + FLASH_SIZE_DEFAULT - 1U),
  },
  /* allow non secure access to bootloader code */
  {
    3,
    (uint32_t)BOOTLOADER_BASE_NS,
    ((uint32_t)BOOTLOADER_BASE_NS + BOOTLOADER_SIZE - 1U),
  },
  /* allow non secure access to Engi bits */
  {
    4,
    (uint32_t)ENGI_START,
    ((uint32_t)ENGI_START + ENGI_SIZE - 1U),
  },
};

extern ARM_DRIVER_FLASH LOADER_FLASH_DEV_NAME;
/** @addtogroup  FW_UPDATE Firmware Update Example
  * @{
  */
	
/** @defgroup  FW_UPDATE_Private_Variables Private Variables
  * @{
  */
static uint32_t m_uFileSizeYmodem = 0U;    /* !< Ymodem File size*/
static uint32_t m_uNbrBlocksYmodem = 0U;   /* !< Ymodem Number of blocks*/
static uint32_t m_uPacketsReceived = 0U;   /* !< Ymodem packets received*/
static uint32_t m_uFlashSectorSize = 0U;   /* !< Flash Sector Size */
static uint32_t m_uFlashMinWriteSize = 0U; /* !< FLash Min Write access*/
#if   !defined(MCUBOOT_PRIMARY_ONLY)
/** @defgroup  FW_UPDATE_Private_Const Private Const
  * @{
  */
const uint32_t MagicTrailerValue[] =
{
  0xf395c277,
  0x7fefd260,
  0x0f505235,
  0x8079b62c,
};
#endif /* !defined(MCUBOOT_PRIMARY_ONLY) */

/**
  * @}
  */

/** @defgroup  FW_UPDATE_Private_Functions Private Functions
  * @{
  */
static void FW_UPDATE_PrintWelcome(void);
static HAL_StatusTypeDef FW_UPDATE_DownloadNewFirmware(SFU_FwImageFlashTypeDef *pFwImageDwlArea);
static HAL_StatusTypeDef FW_UPDATE_SECURE_APP_IMAGE(void);
#if defined (OEMUROT_ENABLE)
static HAL_StatusTypeDef OEMuROT_UPDATE_IMAGE(void);
static HAL_StatusTypeDef OEMuROT_UPDATE_DATA(void);
#endif
#if defined (MCUBOOT_PRIMARY_ONLY)
static HAL_StatusTypeDef FW_EraseArea(uint32_t offset_start, uint32_t size);
#endif
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
static HAL_StatusTypeDef FW_UPDATE_NONSECURE_APP_IMAGE(void);
#endif /* (MCUBOOT_APP_IMAGE_NUMBER == 2) */
#if (MCUBOOT_S_DATA_IMAGE_NUMBER == 1)
static HAL_StatusTypeDef FW_UPDATE_SECURE_DATA_IMAGE(void);
#endif /* (MCUBOOT_S_DATA_IMAGE_NUMBER == 1) */
#if (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1)
static HAL_StatusTypeDef FW_UPDATE_NONSECURE_DATA_IMAGE(void);
#endif /* (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1) */

static void secure_internal_flash(uint32_t offset_start, uint32_t offset_end);
static void SECURE_loader_run(void);
static void LOADER_Run(void);

extern ARM_DRIVER_FLASH FLASH_DEV_NAME;
#define BANK_NUMBER  2

static void secure_internal_flash(uint32_t offset_start, uint32_t offset_end)
{
  volatile uint32_t *SecBB[4]= {&FLASH_S->SECBB1R1, &FLASH_S->SECBB1R2,
                                &FLASH_S->SECBB2R1, &FLASH_S->SECBB2R2};
  volatile uint32_t *ptr;
  uint32_t regwrite=0x0, index;
  uint32_t block_start = offset_start;
  uint32_t block_end =  offset_end;
  const ARM_FLASH_INFO *flash_info;

  flash_info = FLASH_DEV_NAME.GetInfo();

  block_start = block_start / flash_info->page_size;
  block_end = (block_end / flash_info->page_size) ;

  /* 1f is for 32 bits */
  for (index = block_start & ~0x1f; index < flash_info->sector_count ; index++)
  { /* clean register on index aligned */
    if (!(index & 0x1f)){
       regwrite=0x0;
    }
    if ((index >= block_start) && (index <= block_end))
      regwrite = regwrite | ( 1 << (index & 0x1f));
    /* write register when 32 sub block are set or last block to set  */
    if ((index & 0x1f ) == 0x1f) {
      ptr = (uint32_t *)SecBB[index>>5];
      *ptr = regwrite;
    }
  }
}

/**
  * @brief  GTZC configuration before jumping into loader
  * @param  None
  * @retval None
  */
static void gtzc_loader_cfg(void)
{
  uint32_t i = 0U;

