STChens/STM32CubeH5/Projects/NUCLEO-H553ZG/Applications/ROT/Loader/Src/fw_update_app.c
  /* configuration stage */
	__HAL_RCC_GTZC1_CLK_ENABLE();

  /* Allow secure to access to non secure */
  GTZC_MPCBB1_S->CR |= GTZC_MPCBB_CR_SRWILADIS_Msk;
	/* All bocks of SRAM1 configured non secure / privileged (default value)  */
	for (i = 0; i < GTZC_MPCBB1_NB_VCTR; i++)
	{
		/*SRAM1 -> MPCBB1*/
		GTZC_MPCBB1_S->SECCFGR[i] = GTZC_MPCBB_ALL_NSEC;
		GTZC_MPCBB1_S->PRIVCFGR[i] = GTZC_MPCBB_ALL_NPRIV;
	}

	/* All bocks of SRAM3 configured non secure / privileged (default value)  */
	for (i = 0; i < GTZC_MPCBB3_NB_VCTR; i++)
	{
		/*SRAM3 -> MPCBB3*/
		GTZC_MPCBB3_S->SECCFGR[i] = GTZC_MPCBB_ALL_NSEC;
		GTZC_MPCBB3_S->PRIVCFGR[i] = GTZC_MPCBB_ALL_NPRIV;
	}

	/* Required peripherals configured non secure / non privileged */
	GTZC_TZSC1_S->PRIVCFGR1 = ~TZSC_MASK_R1;
	GTZC_TZSC1_S->PRIVCFGR2 = ~TZSC_MASK_R2;
	GTZC_TZSC1_S->PRIVCFGR3 = ~TZSC_MASK_R3;

	GTZC_TZSC1_S->SECCFGR1 = ~TZSC_MASK_R1;
	GTZC_TZSC1_S->SECCFGR2 = ~TZSC_MASK_R2;
	GTZC_TZSC1_S->SECCFGR3 = ~TZSC_MASK_R3;
  
}

/**
  * @brief  configure NVIC before jumping into loader
  * @param  None
  * @retval None
  */
static void nvic_loader_cfg(void)
{
	/* Enable HardFault/busFault and NMI exception in ns.
	 * It is up to BL to drive non-secure faults
	 * Do not enter in secure on non-secure fault
	 */
	SCB->AIRCR  = (uint32_t)((0x5FAUL << SCB_AIRCR_VECTKEY_Pos) |
													 (SCB->AIRCR & 0x0000FFFFU) |
													 SCB_AIRCR_BFHFNMINS_Msk);


	NVIC->ITNS[0U] = RSS_NVIC_INIT_ITNS0_VAL;
	NVIC->ITNS[1U] = RSS_NVIC_INIT_ITNS1_VAL;
	NVIC->ITNS[2U] = RSS_NVIC_INIT_ITNS2_VAL;
	NVIC->ITNS[3U] = RSS_NVIC_INIT_ITNS3_VAL;

}

/**
  * @brief  GPIO configuration before jumping into loader
  * @param  None
  * @retval None
  */
static void gpio_loader_cfg(void)
{
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();

	/* Required GPIO configured non secure */
	GPIOA_S->SECCFGR = ~GPIOA_MASK_SECCFG;
	GPIOB_S->SECCFGR = ~GPIOB_MASK_SECCFG;
	GPIOC_S->SECCFGR = ~GPIOC_MASK_SECCFG;
	GPIOD_S->SECCFGR = ~GPIOD_MASK_SECCFG;
}

/**
  * @brief  Sau idau configuration before jumping into loader
  * @retval None
  */
void SECURE_loader_run(void)
{
  uint32_t i = 0U;

  /* configuration stage */
  __HAL_RCC_GTZC1_CLK_ENABLE();

  /* Allow secure to access to non secure */
	gtzc_loader_cfg();

  /* Required GPIO configured non secure */
  gpio_loader_cfg();

  /* disable MPU */
   MPU->CTRL = 0;
   MPU_NS->CTRL = 0;

  for (i = 0U; i < ARRAY_SIZE(sau_load_cfg); i++)
  {
    SAU->RNR = sau_load_cfg[i].RNR;
    SAU->RBAR = sau_load_cfg[i].RBAR & SAU_RBAR_BADDR_Msk;
    SAU->RLAR = (sau_load_cfg[i].RLAR & SAU_RLAR_LADDR_Msk) |
                SAU_RLAR_ENABLE_Msk;
  }

#if (defined MCUBOOT_PRIMARY_ONLY) && (defined USE_SYSTEM_LOADER) 
	/* we only secure the FLASH SECBB up to OEMiROT area */
	secure_internal_flash(0x00, FLASH_AREA_BEGIN_OFFSET-1);
#else
  secure_internal_flash(0x00, S_IMAGE_SECONDARY_PARTITION_OFFSET-1);
#endif
  
  /* Force memory writes before continuing */
  __DSB();
  /* Flush and refill pipeline with updated permissions */
  __ISB();
  /* Enable SAU */
  TZ_SAU_Enable();

	nvic_loader_cfg();

  /* Stop systick before jumping */
  HAL_SuspendTick();

  uint32_t boot_address = cmse_nsfptr_create(*(uint32_t *)(BOOTLOADER_BASE_NS + 4U));

  /*Increment HDPL to HDPL3*/
  SET_BIT(SBS->HDPLCR,  SBS_HDPLCR_INCR_HDPL);

  __TZ_set_MSP_NS((*(uint32_t *)BOOTLOADER_BASE_NS));
  SCB_NS->VTOR = BOOTLOADER_BASE_NS;

  __asm volatile("movs r0, %0\n"
               "movs r1, #0\n" /*clear registers before jumping to non-secure*/
               "movs r2, #0\n"
               "movs r3, #0\n"
               "movs r4, #0\n"
               "movs r5, #0\n"
               "movs r6, #0\n"
               "movs r7, #0\n"
               "mov r8, r5\n"
               "mov r9, r5\n"
               "mov r10, r5\n"
               "mov r11, r5\n"
               "mov r12, r5\n"
               "MSR APSR_nzcvq,r1\n" /*clear APSR*/
               "bxns r0\n"::"r"(boot_address)); /*jump to non-secure address*/
  /*BXNS, no return here possible*/
}

/**
  * @brief  Perform Jump to the BootLoader
  * @retval None.
  */
static void LOADER_Run(void)
{
#if defined (MCUBOOT_PRIMARY_ONLY)
  HAL_StatusTypeDef status;
  printf("\r\n  Erase download area before jumping to the bootloader");
  secure_internal_flash(0, FLASH_AREA_0_OFFSET + FLASH_AREA_0_SIZE -1);
  status = FW_EraseArea(FLASH_AREA_0_OFFSET, FLASH_AREA_0_SIZE);
  if (status != HAL_OK)
  {
    printf("\r\n  Erase download area failed!\r\n");
    return;
  }
#endif
  
  printf("\r\n  Start config before jumping to the bootloader");

  for (int i = 0; i < 16; i++)
  {
    /*SRAM1 -> MPCBB1*/
    GTZC_MPCBB1_NS->SECCFGR[i] = 0;
  }

  /*  change stack limit  */
  __set_MSPLIM(0);

  printf("\r\n  Standard Bootloader started");
  printf("\r\n  If you want to connect through USART interface, disconnect your TeraTerm");
  printf("\r\n  Start download with STM32CubeProgrammer through supported interfaces (USART/SPI/I2C/USB)\r\n");
  printf("\r\n");

  SECURE_loader_run();
}

/**
  * @}
  */
/** @defgroup  FW_UPDATE_Exported_Functions Exported Functions
  * @{
  */

/** @defgroup  FW_UPDATE_Control_Functions Control Functions
  * @{
   */
void FW_UPDATE_Run(void)
{
  uint8_t key = 0U;
  uint8_t exit = 0U;

  /* Print Firmware Update welcome message */
  FW_UPDATE_PrintWelcome();

  while (exit == 0U)
  {
    key = 0U;

    /* Clean the input path */
    COM_Flush();

    /* Receive key */
    if (COM_Receive(&key, 1U, RX_TIMEOUT) == HAL_OK)
    {
      switch (key)
      {
			case 'b' :
					LOADER_Run();
          break;				
      case '1' :
          printf("  -- Install image : reboot\r\n\n");
          NVIC_SystemReset();
          break;
      case '2' :
          FW_UPDATE_SECURE_APP_IMAGE();
          break;
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
      case '3' :
          FW_UPDATE_NONSECURE_APP_IMAGE();
          break;
#endif /*  (MCUBOOT_APP_IMAGE_NUMBER == 2) */
#if (MCUBOOT_S_DATA_IMAGE_NUMBER == 1)
      case '4' :
          FW_UPDATE_SECURE_DATA_IMAGE();
          break;
#endif /* (MCUBOOT_S_DATA_IMAGE_NUMBER == 1) */
#if (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1)
      case '5' :
          FW_UPDATE_NONSECURE_DATA_IMAGE();
          break;
#endif /* (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1) */
#if defined (OEMUROT_ENABLE)
      case '6' :
          OEMuROT_UPDATE_IMAGE();
          break;
      case '7' :
          OEMuROT_UPDATE_DATA();
          break;
#endif      
      case 'x':
          printf("Exit from FW update menu\r\n");
          exit =1;
          break;
      default:
          printf("Invalid Number !\r");
          break;
      }
      /* Print Main Menu message */
      FW_UPDATE_PrintWelcome();
    }
  }
}

#if defined (OEMUROT_ENABLE)
/**
  * @brief  Run OEMuROT FW Update process.
  * @param  None
  * @retval HAL Status.
  */
static HAL_StatusTypeDef OEMuROT_UPDATE_IMAGE(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  SFU_FwImageFlashTypeDef fw_image_dwl_area;
  ARM_FLASH_INFO *data = LOADER_FLASH_DEV_NAME.GetInfo();
  /* Print Firmware Update welcome message */
  printf("Download OEMuROT update Image\r\n");

  /* Get Info about the download area */
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_OEMuROT_FW_OFFSET; 
  fw_image_dwl_area.MaxSizeInBytes = FLASH_AREA_OEMuROT_FW_SIZE; 

