STChens/STM32CubeH5/Projects/NUCLEO-H553ZG/Applications/ROT/Loader/Src/fw_update_app.c
  fw_image_dwl_area.ImageOffsetInBytes = 0x0;
  m_uFlashSectorSize = data->sector_size;
  m_uFlashMinWriteSize = data->program_unit;
  /* Download new firmware image*/
  ret = FW_UPDATE_DownloadNewFirmware(&fw_image_dwl_area);

  if (HAL_OK == ret)
  {
    printf("  -- OEMuROT update Image correctly downloaded \r\n\n");
    HAL_Delay(1000U);
  }

  return ret;
}

/**
  * @brief  Run OEMuROT Data Update process.
  * @param  None
  * @retval HAL Status.
  */
static HAL_StatusTypeDef OEMuROT_UPDATE_DATA(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  SFU_FwImageFlashTypeDef fw_image_dwl_area;
  ARM_FLASH_INFO *data = LOADER_FLASH_DEV_NAME.GetInfo();
  /* Print Firmware Update welcome message */
  printf("Download OEMuROT update Image\r\n");

  /* Get Info about the download area */
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_OEMuROT_DATA_OFFSET; 
  fw_image_dwl_area.MaxSizeInBytes = FLASH_AREA_OEMuROT_DATA_SIZE; 

  fw_image_dwl_area.ImageOffsetInBytes = 0x0;
  m_uFlashSectorSize = data->sector_size;
  m_uFlashMinWriteSize = data->program_unit;
  /* Download new firmware image*/
  ret = FW_UPDATE_DownloadNewFirmware(&fw_image_dwl_area);

  if (HAL_OK == ret)
  {
    printf("  -- OEMuROT update Image correctly downloaded \r\n\n");
    HAL_Delay(1000U);
  }

  return ret;
}

#endif

/**
  * @brief  Run FW Update process.
  * @param  None
  * @retval HAL Status.
  */
static HAL_StatusTypeDef FW_UPDATE_SECURE_APP_IMAGE(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  SFU_FwImageFlashTypeDef fw_image_dwl_area;
  ARM_FLASH_INFO *data = LOADER_FLASH_DEV_NAME.GetInfo();
  /* Print Firmware Update welcome message */
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
  printf("Download Secure App Image\r\n");
#else
  printf("Download App Image\r\n");
#endif /* (MCUBOOT_APP_IMAGE_NUMBER == 2) */
  /* Get Info about the download area */
#if  defined(MCUBOOT_PRIMARY_ONLY)
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_0_OFFSET;
  fw_image_dwl_area.MaxSizeInBytes = FLASH_AREA_0_SIZE;
#else
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_2_OFFSET;
  fw_image_dwl_area.MaxSizeInBytes = FLASH_AREA_2_SIZE;
#endif /* MCUBOOT_PRIMARY_ONLY */
  fw_image_dwl_area.ImageOffsetInBytes = 0x0;
  m_uFlashSectorSize = data->sector_size;
  m_uFlashMinWriteSize = data->program_unit;
  /* Download new firmware image*/
  ret = FW_UPDATE_DownloadNewFirmware(&fw_image_dwl_area);

  if (HAL_OK == ret)
  {
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
    printf("  -- Secure App Image correctly downloaded \r\n\n");
#else
    printf("  -- App Image correctly downloaded \r\n\n");
#endif /* (MCUBOOT_APP_IMAGE_NUMBER == 2) */
    HAL_Delay(1000U);
  }

  return ret;
}
#if (MCUBOOT_APP_IMAGE_NUMBER == 2)
/**
  * @brief  Run FW Update process.
  * @param  None
  * @retval HAL Status.
  */
static HAL_StatusTypeDef FW_UPDATE_NONSECURE_APP_IMAGE(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  SFU_FwImageFlashTypeDef fw_image_dwl_area;
  ARM_FLASH_INFO *data = LOADER_FLASH_DEV_NAME.GetInfo();
  /* Print Firmware Update welcome message */
  printf("Download NonSecure App Image\r\n");

  /* Get Info about the download area */
#if  defined(MCUBOOT_PRIMARY_ONLY)
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_1_OFFSET;
#else
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_3_OFFSET;
#endif /* MCUBOOT_PRIMARY_ONLY */
  fw_image_dwl_area.MaxSizeInBytes = FLASH_NS_PARTITION_SIZE;
  fw_image_dwl_area.ImageOffsetInBytes = 0x0;
  m_uFlashSectorSize = data->sector_size;
  m_uFlashMinWriteSize = data->program_unit;
  /* Download new firmware image*/
  ret = FW_UPDATE_DownloadNewFirmware(&fw_image_dwl_area);

  if (HAL_OK == ret)
  {
    printf("  -- NonSecure App Image correctly downloaded \r\n\n");
    HAL_Delay(1000U);
  }

  return ret;
}
#endif /* (MCUBOOT_APP_IMAGE_NUMBER == 2) */

#if (MCUBOOT_S_DATA_IMAGE_NUMBER == 1)
/**
  * @brief  Run FW Update process.
  * @param  None
  * @retval HAL Status.
  */
static HAL_StatusTypeDef FW_UPDATE_SECURE_DATA_IMAGE(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  SFU_FwImageFlashTypeDef fw_image_dwl_area;
  ARM_FLASH_INFO *data = LOADER_FLASH_DEV_NAME.GetInfo();
  /* Print Firmware Update welcome message */
  printf("Download Secure Data Image\r\n");
  /* Get Info about the download area */
#if  defined(MCUBOOT_PRIMARY_ONLY)
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_4_OFFSET;
  fw_image_dwl_area.MaxSizeInBytes = FLASH_AREA_4_SIZE;
#else
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_6_OFFSET;
  fw_image_dwl_area.MaxSizeInBytes = FLASH_AREA_6_SIZE;
#endif /* MCUBOOT_PRIMARY_ONLY */
  fw_image_dwl_area.ImageOffsetInBytes = 0x0;
  m_uFlashSectorSize = data->sector_size;
  m_uFlashMinWriteSize = data->program_unit;
  /* Download new firmware image*/
  ret = FW_UPDATE_DownloadNewFirmware(&fw_image_dwl_area);

  if (HAL_OK == ret)
  {
    printf("  -- Secure Data Image correctly downloaded \r\n\n");
    HAL_Delay(1000U);
  }

  return ret;
}
#endif /* (MCUBOOT_S_DATA_IMAGE_NUMBER == 1) */

#if (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1)
/**
  * @brief  Run FW Update process.
  * @param  None
  * @retval HAL Status.
  */
static HAL_StatusTypeDef FW_UPDATE_NONSECURE_DATA_IMAGE(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  SFU_FwImageFlashTypeDef fw_image_dwl_area;
  ARM_FLASH_INFO *data = LOADER_FLASH_DEV_NAME.GetInfo();
  /* Print Firmware Update welcome message */
  printf("Download NonSecure Data Image\r\n");
  /* Get Info about the download area */
#if  defined(MCUBOOT_PRIMARY_ONLY)
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_5_OFFSET;
  fw_image_dwl_area.MaxSizeInBytes = FLASH_AREA_5_SIZE;
#else
  fw_image_dwl_area.DownloadAddr =  FLASH_AREA_7_OFFSET;
  fw_image_dwl_area.MaxSizeInBytes = FLASH_AREA_7_SIZE;
#endif /* defined(MCUBOOT_PRIMARY_ONLY) */
  fw_image_dwl_area.ImageOffsetInBytes = 0x0;
  m_uFlashSectorSize = data->sector_size;
  m_uFlashMinWriteSize = data->program_unit;
  /* Download new firmware image*/
  ret = FW_UPDATE_DownloadNewFirmware(&fw_image_dwl_area);

  if (HAL_OK == ret)
  {
    printf("  -- NonSecure Data Image correctly downloaded \r\n\n");
    HAL_Delay(1000U);
  }

  return ret;
}

#endif /* (MCUBOOT_NS_DATA_IMAGE_NUMBER == 1) */

/**
  * @}
  */

/**
  * @}
  */

